import { Stack, Text } from "@mantine/core";
import { Accordions } from "../Common/Accordion/Accordion";
import classes from "./Question.module.css";

const questions = [
    {
        title: "مراحل طراحی وب سایت چیست؟",
        body: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز.",
    },
    {
        title: "مراحل طراحی وب سایت چیست؟",
        body: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز.",
    },
    {
        title: "مراحل طراحی وب سایت چیست؟",
        body: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز.",
    },
    {
        title: "مراحل طراحی وب سایت چیست؟",
        body: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز.",
    },
    {
        title: "مراحل طراحی وب سایت چیست؟",
        body: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز.",
    },
];

export const Question = () => {
    return (
        <div className={classes.faqSec}>
            <div className="container mx-auto px-4">
                <div className="grid grid-cols-12 gap-4 px-0 md:px-10 py-10 md:py-20 rounded-lg bg-white">
                    <div className="col-span-12 md:col-span-4">
                        <Stack gap={8} className={classes.faqTxt}>
                            <h3 style={{ whiteSpace: "nowrap" }}>FAQ</h3>
                            <h3 style={{ whiteSpace: "nowrap" }}>
                                سوالات متداولی که از ما می‌پرسید
                            </h3>
                            <Text style={{ textAlign: "start" }} visibleFrom="md">
                                سوالات متداولی که ممکن است نیاز شما نیز باشند در اینجا پاسخ داده شده
                                اند:
                            </Text>
                        </Stack>
                    </div>
                    <div className="col-span-12 md:col-span-8">
                        <Accordions data={questions} />
                    </div>
                </div>
            </div>
        </div>
    );
};
